draco-sam/WPT_drone/WPT/RX/RX_USB_I2C/01_lib_wpt_rx/PIC24FJ128GC006.h
#define ADTBL29 ADTBL29
extern volatile uint16_t  ADTBL29 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL29BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL29BITS;
extern volatile ADTBL29BITS ADTBL29bits __attribute__((__sfr__));

#define ADTBL30 ADTBL30
extern volatile uint16_t  ADTBL30 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL30BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL30BITS;
extern volatile ADTBL30BITS ADTBL30bits __attribute__((__sfr__));

#define ADTBL31 ADTBL31
extern volatile uint16_t  ADTBL31 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL31BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL31BITS;
extern volatile ADTBL31BITS ADTBL31bits __attribute__((__sfr__));

#define ADRES0 ADRES0
extern volatile uint16_t  ADRES0 __attribute__((__sfr__));
#define ADRES1 ADRES1
extern volatile uint16_t  ADRES1 __attribute__((__sfr__));
#define ADRES2 ADRES2
extern volatile uint16_t  ADRES2 __attribute__((__sfr__));
#define ADRES3 ADRES3
extern volatile uint16_t  ADRES3 __attribute__((__sfr__));
#define ADRES4 ADRES4
extern volatile uint16_t  ADRES4 __attribute__((__sfr__));
#define ADRES5 ADRES5
extern volatile uint16_t  ADRES5 __attribute__((__sfr__));
#define ADRES6 ADRES6
extern volatile uint16_t  ADRES6 __attribute__((__sfr__));
#define ADRES7 ADRES7
extern volatile uint16_t  ADRES7 __attribute__((__sfr__));
#define ADRES8 ADRES8
extern volatile uint16_t  ADRES8 __attribute__((__sfr__));
#define ADRES9 ADRES9
extern volatile uint16_t  ADRES9 __attribute__((__sfr__));
#define ADRES10 ADRES10
extern volatile uint16_t  ADRES10 __attribute__((__sfr__));
#define ADRES11 ADRES11
extern volatile uint16_t  ADRES11 __attribute__((__sfr__));
#define ADRES12 ADRES12
extern volatile uint16_t  ADRES12 __attribute__((__sfr__));
#define ADRES13 ADRES13
extern volatile uint16_t  ADRES13 __attribute__((__sfr__));
#define ADRES14 ADRES14
extern volatile uint16_t  ADRES14 __attribute__((__sfr__));
#define ADRES15 ADRES15
extern volatile uint16_t  ADRES15 __attribute__((__sfr__));
#define ADRES16 ADRES16
extern volatile uint16_t  ADRES16 __attribute__((__sfr__));
#define ADRES17 ADRES17
extern volatile uint16_t  ADRES17 __attribute__((__sfr__));
#define ADRES18 ADRES18
extern volatile uint16_t  ADRES18 __attribute__((__sfr__));
#define ADRES19 ADRES19
extern volatile uint16_t  ADRES19 __attribute__((__sfr__));
#define ADRES20 ADRES20
extern volatile uint16_t  ADRES20 __attribute__((__sfr__));
#define ADRES21 ADRES21
extern volatile uint16_t  ADRES21 __attribute__((__sfr__));
#define ADRES22 ADRES22
extern volatile uint16_t  ADRES22 __attribute__((__sfr__));
#define ADRES23 ADRES23
extern volatile uint16_t  ADRES23 __attribute__((__sfr__));
#define ADRES24 ADRES24
extern volatile uint16_t  ADRES24 __attribute__((__sfr__));
#define ADRES25 ADRES25
extern volatile uint16_t  ADRES25 __attribute__((__sfr__));
#define ADRES26 ADRES26
extern volatile uint16_t  ADRES26 __attribute__((__sfr__));
#define ADRES27 ADRES27
extern volatile uint16_t  ADRES27 __attribute__((__sfr__));
#define ADRES28 ADRES28
extern volatile uint16_t  ADRES28 __attribute__((__sfr__));
#define ADRES29 ADRES29
extern volatile uint16_t  ADRES29 __attribute__((__sfr__));
#define ADRES30 ADRES30
extern volatile uint16_t  ADRES30 __attribute__((__sfr__));
#define ADRES31 ADRES31
extern volatile uint16_t  ADRES31 __attribute__((__sfr__));
#define DMACON DMACON
extern volatile uint16_t  DMACON __attribute__((__sfr__));
typedef struct tagDMACONBITS {
  uint16_t PRSSEL:1;
  uint16_t :14;
  uint16_t DMAEN:1;
} DMACONBITS;
extern volatile DMACONBITS DMACONbits __attribute__((__sfr__));

#define DMABUF DMABUF
extern volatile uint16_t  DMABUF __attribute__((__sfr__));
#define DMAL DMAL
extern volatile uint16_t  DMAL __attribute__((__sfr__));
#define DMAH DMAH
extern volatile uint16_t  DMAH __attribute__((__sfr__));
#define DMACH0 DMACH0
extern volatile uint16_t  DMACH0 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH0BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH0BITS;
extern volatile DMACH0BITS DMACH0bits __attribute__((__sfr__));

#define DMAINT0 DMAINT0
extern volatile uint16_t  DMAINT0 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT0BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:6;
      uint16_t :1;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
    };
  };
} DMAINT0BITS;
extern volatile DMAINT0BITS DMAINT0bits __attribute__((__sfr__));

#define DMASRC0 DMASRC0
extern volatile uint16_t  DMASRC0 __attribute__((__sfr__));
#define DMADST0 DMADST0
extern volatile uint16_t  DMADST0 __attribute__((__sfr__));
#define DMACNT0 DMACNT0
extern volatile uint16_t  DMACNT0 __attribute__((__sfr__));
#define DMACH1 DMACH1
extern volatile uint16_t  DMACH1 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH1BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH1BITS;
extern volatile DMACH1BITS DMACH1bits __attribute__((__sfr__));

#define DMAINT1 DMAINT1
extern volatile uint16_t  DMAINT1 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT1BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:6;
      uint16_t :1;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
    };
  };
} DMAINT1BITS;
extern volatile DMAINT1BITS DMAINT1bits __attribute__((__sfr__));

#define DMASRC1 DMASRC1
extern volatile uint16_t  DMASRC1 __attribute__((__sfr__));
#define DMADST1 DMADST1
extern volatile uint16_t  DMADST1 __attribute__((__sfr__));
#define DMACNT1 DMACNT1
extern volatile uint16_t  DMACNT1 __attribute__((__sfr__));
#define DMACH2 DMACH2
extern volatile uint16_t  DMACH2 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH2BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH2BITS;
extern volatile DMACH2BITS DMACH2bits __attribute__((__sfr__));

