draco-sam/WPT_drone/WPT/RX/RX_USB_I2C/01_lib_wpt_rx/PIC24FJ128GC006.h
#define _AMP1CON_AMPSLP_POSITION                 0x0000000C
#define _AMP1CON_AMPSLP_MASK                     0x00001000
#define _AMP1CON_AMPSLP_LENGTH                   0x00000001

#define _AMP1CON_AMPSIDL_POSITION                0x0000000D
#define _AMP1CON_AMPSIDL_MASK                    0x00002000
#define _AMP1CON_AMPSIDL_LENGTH                  0x00000001

#define _AMP1CON_AMPEN_POSITION                  0x0000000F
#define _AMP1CON_AMPEN_MASK                      0x00008000
#define _AMP1CON_AMPEN_LENGTH                    0x00000001

#define _AMP1CON_PINSEL0_POSITION                0x00000000
#define _AMP1CON_PINSEL0_MASK                    0x00000001
#define _AMP1CON_PINSEL0_LENGTH                  0x00000001

#define _AMP1CON_PINSEL1_POSITION                0x00000001
#define _AMP1CON_PINSEL1_MASK                    0x00000002
#define _AMP1CON_PINSEL1_LENGTH                  0x00000001

#define _AMP1CON_PINSEL2_POSITION                0x00000002
#define _AMP1CON_PINSEL2_MASK                    0x00000004
#define _AMP1CON_PINSEL2_LENGTH                  0x00000001

#define _AMP1CON_NINSEL0_POSITION                0x00000003
#define _AMP1CON_NINSEL0_MASK                    0x00000008
#define _AMP1CON_NINSEL0_LENGTH                  0x00000001

#define _AMP1CON_NINSEL1_POSITION                0x00000004
#define _AMP1CON_NINSEL1_MASK                    0x00000010
#define _AMP1CON_NINSEL1_LENGTH                  0x00000001

#define _AMP1CON_NINSEL2_POSITION                0x00000005
#define _AMP1CON_NINSEL2_MASK                    0x00000020
#define _AMP1CON_NINSEL2_LENGTH                  0x00000001

#define _AMP1CON_INTPOL0_POSITION                0x0000000A
#define _AMP1CON_INTPOL0_MASK                    0x00000400
#define _AMP1CON_INTPOL0_LENGTH                  0x00000001

#define _AMP1CON_INTPOL1_POSITION                0x0000000B
#define _AMP1CON_INTPOL1_MASK                    0x00000800
#define _AMP1CON_INTPOL1_LENGTH                  0x00000001

#define _AMP2CON_PINSEL_POSITION                 0x00000000
#define _AMP2CON_PINSEL_MASK                     0x00000007
#define _AMP2CON_PINSEL_LENGTH                   0x00000003

#define _AMP2CON_NINSEL_POSITION                 0x00000003
#define _AMP2CON_NINSEL_MASK                     0x00000038
#define _AMP2CON_NINSEL_LENGTH                   0x00000003

#define _AMP2CON_AMPOE_POSITION                  0x00000006
#define _AMP2CON_AMPOE_MASK                      0x00000040
#define _AMP2CON_AMPOE_LENGTH                    0x00000001

#define _AMP2CON_SPDSEL_POSITION                 0x00000007
#define _AMP2CON_SPDSEL_MASK                     0x00000080
#define _AMP2CON_SPDSEL_LENGTH                   0x00000001

#define _AMP2CON_CMPSEL_POSITION                 0x00000008
#define _AMP2CON_CMPSEL_MASK                     0x00000100
#define _AMP2CON_CMPSEL_LENGTH                   0x00000001

#define _AMP2CON_CMOUT_POSITION                  0x00000009
#define _AMP2CON_CMOUT_MASK                      0x00000200
#define _AMP2CON_CMOUT_LENGTH                    0x00000001

#define _AMP2CON_INTPOL_POSITION                 0x0000000A
#define _AMP2CON_INTPOL_MASK                     0x00000C00
#define _AMP2CON_INTPOL_LENGTH                   0x00000002

#define _AMP2CON_AMPSLP_POSITION                 0x0000000C
#define _AMP2CON_AMPSLP_MASK                     0x00001000
#define _AMP2CON_AMPSLP_LENGTH                   0x00000001

#define _AMP2CON_AMPSIDL_POSITION                0x0000000D
#define _AMP2CON_AMPSIDL_MASK                    0x00002000
#define _AMP2CON_AMPSIDL_LENGTH                  0x00000001

#define _AMP2CON_AMPEN_POSITION                  0x0000000F
#define _AMP2CON_AMPEN_MASK                      0x00008000
#define _AMP2CON_AMPEN_LENGTH                    0x00000001

#define _AMP2CON_PINSEL0_POSITION                0x00000000
#define _AMP2CON_PINSEL0_MASK                    0x00000001
#define _AMP2CON_PINSEL0_LENGTH                  0x00000001

#define _AMP2CON_PINSEL1_POSITION                0x00000001
#define _AMP2CON_PINSEL1_MASK                    0x00000002
#define _AMP2CON_PINSEL1_LENGTH                  0x00000001

#define _AMP2CON_PINSEL2_POSITION                0x00000002
#define _AMP2CON_PINSEL2_MASK                    0x00000004
#define _AMP2CON_PINSEL2_LENGTH                  0x00000001

#define _AMP2CON_NINSEL0_POSITION                0x00000003
#define _AMP2CON_NINSEL0_MASK                    0x00000008
#define _AMP2CON_NINSEL0_LENGTH                  0x00000001

#define _AMP2CON_NINSEL1_POSITION                0x00000004
#define _AMP2CON_NINSEL1_MASK                    0x00000010
#define _AMP2CON_NINSEL1_LENGTH                  0x00000001

#define _AMP2CON_NINSEL2_POSITION                0x00000005
#define _AMP2CON_NINSEL2_MASK                    0x00000020
#define _AMP2CON_NINSEL2_LENGTH                  0x00000001

#define _AMP2CON_INTPOL0_POSITION                0x0000000A
#define _AMP2CON_INTPOL0_MASK                    0x00000400
#define _AMP2CON_INTPOL0_LENGTH                  0x00000001

#define _AMP2CON_INTPOL1_POSITION                0x0000000B
#define _AMP2CON_INTPOL1_MASK                    0x00000800
#define _AMP2CON_INTPOL1_LENGTH                  0x00000001

#define _U3MODE_STSEL_POSITION                   0x00000000
#define _U3MODE_STSEL_MASK                       0x00000001
#define _U3MODE_STSEL_LENGTH                     0x00000001

#define _U3MODE_PDSEL_POSITION                   0x00000001
#define _U3MODE_PDSEL_MASK                       0x00000006
#define _U3MODE_PDSEL_LENGTH                     0x00000002

#define _U3MODE_BRGH_POSITION                    0x00000003
#define _U3MODE_BRGH_MASK                        0x00000008
#define _U3MODE_BRGH_LENGTH                      0x00000001

#define _U3MODE_URXINV_POSITION                  0x00000004
#define _U3MODE_URXINV_MASK                      0x00000010
#define _U3MODE_URXINV_LENGTH                    0x00000001

#define _U3MODE_ABAUD_POSITION                   0x00000005
#define _U3MODE_ABAUD_MASK                       0x00000020
#define _U3MODE_ABAUD_LENGTH                     0x00000001

#define _U3MODE_LPBACK_POSITION                  0x00000006
#define _U3MODE_LPBACK_MASK                      0x00000040
#define _U3MODE_LPBACK_LENGTH                    0x00000001

#define _U3MODE_WAKE_POSITION                    0x00000007
#define _U3MODE_WAKE_MASK                        0x00000080
#define _U3MODE_WAKE_LENGTH                      0x00000001

#define _U3MODE_UEN_POSITION                     0x00000008
#define _U3MODE_UEN_MASK                         0x00000300
#define _U3MODE_UEN_LENGTH                       0x00000002

#define _U3MODE_RTSMD_POSITION                   0x0000000B
#define _U3MODE_RTSMD_MASK                       0x00000800
#define _U3MODE_RTSMD_LENGTH                     0x00000001

#define _U3MODE_IREN_POSITION                    0x0000000C
#define _U3MODE_IREN_MASK                        0x00001000
#define _U3MODE_IREN_LENGTH                      0x00000001

#define _U3MODE_USIDL_POSITION                   0x0000000D
#define _U3MODE_USIDL_MASK                       0x00002000
#define _U3MODE_USIDL_LENGTH                     0x00000001

