draco-sam/WPT_drone/WPT/RX/RX_USB_I2C/01_lib_wpt_rx/PIC24FJ128GC006.h
#define _TRISG_TRISG6_POSITION                   0x00000006
#define _TRISG_TRISG6_MASK                       0x00000040
#define _TRISG_TRISG6_LENGTH                     0x00000001

#define _TRISG_TRISG7_POSITION                   0x00000007
#define _TRISG_TRISG7_MASK                       0x00000080
#define _TRISG_TRISG7_LENGTH                     0x00000001

#define _TRISG_TRISG8_POSITION                   0x00000008
#define _TRISG_TRISG8_MASK                       0x00000100
#define _TRISG_TRISG8_LENGTH                     0x00000001

#define _TRISG_TRISG9_POSITION                   0x00000009
#define _TRISG_TRISG9_MASK                       0x00000200
#define _TRISG_TRISG9_LENGTH                     0x00000001

#define _PORTG_RG2_POSITION                      0x00000002
#define _PORTG_RG2_MASK                          0x00000004
#define _PORTG_RG2_LENGTH                        0x00000001

#define _PORTG_RG3_POSITION                      0x00000003
#define _PORTG_RG3_MASK                          0x00000008
#define _PORTG_RG3_LENGTH                        0x00000001

#define _PORTG_RG6_POSITION                      0x00000006
#define _PORTG_RG6_MASK                          0x00000040
#define _PORTG_RG6_LENGTH                        0x00000001

#define _PORTG_RG7_POSITION                      0x00000007
#define _PORTG_RG7_MASK                          0x00000080
#define _PORTG_RG7_LENGTH                        0x00000001

#define _PORTG_RG8_POSITION                      0x00000008
#define _PORTG_RG8_MASK                          0x00000100
#define _PORTG_RG8_LENGTH                        0x00000001

#define _PORTG_RG9_POSITION                      0x00000009
#define _PORTG_RG9_MASK                          0x00000200
#define _PORTG_RG9_LENGTH                        0x00000001

#define _LATG_LATG2_POSITION                     0x00000002
#define _LATG_LATG2_MASK                         0x00000004
#define _LATG_LATG2_LENGTH                       0x00000001

#define _LATG_LATG3_POSITION                     0x00000003
#define _LATG_LATG3_MASK                         0x00000008
#define _LATG_LATG3_LENGTH                       0x00000001

#define _LATG_LATG6_POSITION                     0x00000006
#define _LATG_LATG6_MASK                         0x00000040
#define _LATG_LATG6_LENGTH                       0x00000001

#define _LATG_LATG7_POSITION                     0x00000007
#define _LATG_LATG7_MASK                         0x00000080
#define _LATG_LATG7_LENGTH                       0x00000001

#define _LATG_LATG8_POSITION                     0x00000008
#define _LATG_LATG8_MASK                         0x00000100
#define _LATG_LATG8_LENGTH                       0x00000001

#define _LATG_LATG9_POSITION                     0x00000009
#define _LATG_LATG9_MASK                         0x00000200
#define _LATG_LATG9_LENGTH                       0x00000001

#define _ODCG_ODG2_POSITION                      0x00000002
#define _ODCG_ODG2_MASK                          0x00000004
#define _ODCG_ODG2_LENGTH                        0x00000001

#define _ODCG_ODG3_POSITION                      0x00000003
#define _ODCG_ODG3_MASK                          0x00000008
#define _ODCG_ODG3_LENGTH                        0x00000001

#define _ODCG_ODG6_POSITION                      0x00000006
#define _ODCG_ODG6_MASK                          0x00000040
#define _ODCG_ODG6_LENGTH                        0x00000001

#define _ODCG_ODG7_POSITION                      0x00000007
#define _ODCG_ODG7_MASK                          0x00000080
#define _ODCG_ODG7_LENGTH                        0x00000001

#define _ODCG_ODG8_POSITION                      0x00000008
#define _ODCG_ODG8_MASK                          0x00000100
#define _ODCG_ODG8_LENGTH                        0x00000001

#define _ODCG_ODG9_POSITION                      0x00000009
#define _ODCG_ODG9_MASK                          0x00000200
#define _ODCG_ODG9_LENGTH                        0x00000001

#define _PADCFG1_PMPTTL_POSITION                 0x00000000
#define _PADCFG1_PMPTTL_MASK                     0x00000001
#define _PADCFG1_PMPTTL_LENGTH                   0x00000001

#define _ADTBL0_ADCH_POSITION                    0x00000000
#define _ADTBL0_ADCH_MASK                        0x0000007F
#define _ADTBL0_ADCH_LENGTH                      0x00000007

#define _ADTBL0_DIFF_POSITION                    0x0000000E
#define _ADTBL0_DIFF_MASK                        0x00004000
#define _ADTBL0_DIFF_LENGTH                      0x00000001

#define _ADTBL0_UCTMU_POSITION                   0x0000000F
#define _ADTBL0_UCTMU_MASK                       0x00008000
#define _ADTBL0_UCTMU_LENGTH                     0x00000001

#define _ADTBL0_ADCH0_POSITION                   0x00000000
#define _ADTBL0_ADCH0_MASK                       0x00000001
#define _ADTBL0_ADCH0_LENGTH                     0x00000001

#define _ADTBL0_ADCH1_POSITION                   0x00000001
#define _ADTBL0_ADCH1_MASK                       0x00000002
#define _ADTBL0_ADCH1_LENGTH                     0x00000001

#define _ADTBL0_ADCH2_POSITION                   0x00000002
#define _ADTBL0_ADCH2_MASK                       0x00000004
#define _ADTBL0_ADCH2_LENGTH                     0x00000001

#define _ADTBL0_ADCH3_POSITION                   0x00000003
#define _ADTBL0_ADCH3_MASK                       0x00000008
#define _ADTBL0_ADCH3_LENGTH                     0x00000001

#define _ADTBL0_ADCH4_POSITION                   0x00000004
#define _ADTBL0_ADCH4_MASK                       0x00000010
#define _ADTBL0_ADCH4_LENGTH                     0x00000001

#define _ADTBL0_ADCH5_POSITION                   0x00000005
#define _ADTBL0_ADCH5_MASK                       0x00000020
#define _ADTBL0_ADCH5_LENGTH                     0x00000001

#define _ADTBL0_ADCH6_POSITION                   0x00000006
#define _ADTBL0_ADCH6_MASK                       0x00000040
#define _ADTBL0_ADCH6_LENGTH                     0x00000001

#define _ADTBL1_ADCH_POSITION                    0x00000000
#define _ADTBL1_ADCH_MASK                        0x0000007F
#define _ADTBL1_ADCH_LENGTH                      0x00000007

#define _ADTBL1_DIFF_POSITION                    0x0000000E
#define _ADTBL1_DIFF_MASK                        0x00004000
#define _ADTBL1_DIFF_LENGTH                      0x00000001

#define _ADTBL1_UCTMU_POSITION                   0x0000000F
#define _ADTBL1_UCTMU_MASK                       0x00008000
#define _ADTBL1_UCTMU_LENGTH                     0x00000001

#define _ADTBL1_ADCH0_POSITION                   0x00000000
#define _ADTBL1_ADCH0_MASK                       0x00000001
#define _ADTBL1_ADCH0_LENGTH                     0x00000001

