draco-sam/WPT_drone/WPT/RX/RX_USB_I2C/01_lib_wpt_rx/PIC24FJ128GC006.h
#define _ADTBL16_ADCH4_POSITION                  0x00000004
#define _ADTBL16_ADCH4_MASK                      0x00000010
#define _ADTBL16_ADCH4_LENGTH                    0x00000001

#define _ADTBL16_ADCH5_POSITION                  0x00000005
#define _ADTBL16_ADCH5_MASK                      0x00000020
#define _ADTBL16_ADCH5_LENGTH                    0x00000001

#define _ADTBL16_ADCH6_POSITION                  0x00000006
#define _ADTBL16_ADCH6_MASK                      0x00000040
#define _ADTBL16_ADCH6_LENGTH                    0x00000001

#define _ADTBL17_ADCH_POSITION                   0x00000000
#define _ADTBL17_ADCH_MASK                       0x0000007F
#define _ADTBL17_ADCH_LENGTH                     0x00000007

#define _ADTBL17_DIFF_POSITION                   0x0000000E
#define _ADTBL17_DIFF_MASK                       0x00004000
#define _ADTBL17_DIFF_LENGTH                     0x00000001

#define _ADTBL17_UCTMU_POSITION                  0x0000000F
#define _ADTBL17_UCTMU_MASK                      0x00008000
#define _ADTBL17_UCTMU_LENGTH                    0x00000001

#define _ADTBL17_ADCH0_POSITION                  0x00000000
#define _ADTBL17_ADCH0_MASK                      0x00000001
#define _ADTBL17_ADCH0_LENGTH                    0x00000001

#define _ADTBL17_ADCH1_POSITION                  0x00000001
#define _ADTBL17_ADCH1_MASK                      0x00000002
#define _ADTBL17_ADCH1_LENGTH                    0x00000001

#define _ADTBL17_ADCH2_POSITION                  0x00000002
#define _ADTBL17_ADCH2_MASK                      0x00000004
#define _ADTBL17_ADCH2_LENGTH                    0x00000001

#define _ADTBL17_ADCH3_POSITION                  0x00000003
#define _ADTBL17_ADCH3_MASK                      0x00000008
#define _ADTBL17_ADCH3_LENGTH                    0x00000001

#define _ADTBL17_ADCH4_POSITION                  0x00000004
#define _ADTBL17_ADCH4_MASK                      0x00000010
#define _ADTBL17_ADCH4_LENGTH                    0x00000001

#define _ADTBL17_ADCH5_POSITION                  0x00000005
#define _ADTBL17_ADCH5_MASK                      0x00000020
#define _ADTBL17_ADCH5_LENGTH                    0x00000001

#define _ADTBL17_ADCH6_POSITION                  0x00000006
#define _ADTBL17_ADCH6_MASK                      0x00000040
#define _ADTBL17_ADCH6_LENGTH                    0x00000001

#define _ADTBL18_ADCH_POSITION                   0x00000000
#define _ADTBL18_ADCH_MASK                       0x0000007F
#define _ADTBL18_ADCH_LENGTH                     0x00000007

#define _ADTBL18_DIFF_POSITION                   0x0000000E
#define _ADTBL18_DIFF_MASK                       0x00004000
#define _ADTBL18_DIFF_LENGTH                     0x00000001

#define _ADTBL18_UCTMU_POSITION                  0x0000000F
#define _ADTBL18_UCTMU_MASK                      0x00008000
#define _ADTBL18_UCTMU_LENGTH                    0x00000001

#define _ADTBL18_ADCH0_POSITION                  0x00000000
#define _ADTBL18_ADCH0_MASK                      0x00000001
#define _ADTBL18_ADCH0_LENGTH                    0x00000001

#define _ADTBL18_ADCH1_POSITION                  0x00000001
#define _ADTBL18_ADCH1_MASK                      0x00000002
#define _ADTBL18_ADCH1_LENGTH                    0x00000001

#define _ADTBL18_ADCH2_POSITION                  0x00000002
#define _ADTBL18_ADCH2_MASK                      0x00000004
#define _ADTBL18_ADCH2_LENGTH                    0x00000001

#define _ADTBL18_ADCH3_POSITION                  0x00000003
#define _ADTBL18_ADCH3_MASK                      0x00000008
#define _ADTBL18_ADCH3_LENGTH                    0x00000001

#define _ADTBL18_ADCH4_POSITION                  0x00000004
#define _ADTBL18_ADCH4_MASK                      0x00000010
#define _ADTBL18_ADCH4_LENGTH                    0x00000001

#define _ADTBL18_ADCH5_POSITION                  0x00000005
#define _ADTBL18_ADCH5_MASK                      0x00000020
#define _ADTBL18_ADCH5_LENGTH                    0x00000001

#define _ADTBL18_ADCH6_POSITION                  0x00000006
#define _ADTBL18_ADCH6_MASK                      0x00000040
#define _ADTBL18_ADCH6_LENGTH                    0x00000001

#define _ADTBL19_ADCH_POSITION                   0x00000000
#define _ADTBL19_ADCH_MASK                       0x0000007F
#define _ADTBL19_ADCH_LENGTH                     0x00000007

#define _ADTBL19_DIFF_POSITION                   0x0000000E
#define _ADTBL19_DIFF_MASK                       0x00004000
#define _ADTBL19_DIFF_LENGTH                     0x00000001

#define _ADTBL19_UCTMU_POSITION                  0x0000000F
#define _ADTBL19_UCTMU_MASK                      0x00008000
#define _ADTBL19_UCTMU_LENGTH                    0x00000001

#define _ADTBL19_ADCH0_POSITION                  0x00000000
#define _ADTBL19_ADCH0_MASK                      0x00000001
#define _ADTBL19_ADCH0_LENGTH                    0x00000001

#define _ADTBL19_ADCH1_POSITION                  0x00000001
#define _ADTBL19_ADCH1_MASK                      0x00000002
#define _ADTBL19_ADCH1_LENGTH                    0x00000001

#define _ADTBL19_ADCH2_POSITION                  0x00000002
#define _ADTBL19_ADCH2_MASK                      0x00000004
#define _ADTBL19_ADCH2_LENGTH                    0x00000001

#define _ADTBL19_ADCH3_POSITION                  0x00000003
#define _ADTBL19_ADCH3_MASK                      0x00000008
#define _ADTBL19_ADCH3_LENGTH                    0x00000001

#define _ADTBL19_ADCH4_POSITION                  0x00000004
#define _ADTBL19_ADCH4_MASK                      0x00000010
#define _ADTBL19_ADCH4_LENGTH                    0x00000001

#define _ADTBL19_ADCH5_POSITION                  0x00000005
#define _ADTBL19_ADCH5_MASK                      0x00000020
#define _ADTBL19_ADCH5_LENGTH                    0x00000001

#define _ADTBL19_ADCH6_POSITION                  0x00000006
#define _ADTBL19_ADCH6_MASK                      0x00000040
#define _ADTBL19_ADCH6_LENGTH                    0x00000001

#define _ADTBL20_ADCH_POSITION                   0x00000000
#define _ADTBL20_ADCH_MASK                       0x0000007F
#define _ADTBL20_ADCH_LENGTH                     0x00000007

