draco-sam/WPT_drone/WPT/RX/RX_USB_I2C/01_lib_wpt_rx/PIC24FJ128GC006.h
#define _ADTBL23_ADCH2_POSITION                  0x00000002
#define _ADTBL23_ADCH2_MASK                      0x00000004
#define _ADTBL23_ADCH2_LENGTH                    0x00000001

#define _ADTBL23_ADCH3_POSITION                  0x00000003
#define _ADTBL23_ADCH3_MASK                      0x00000008
#define _ADTBL23_ADCH3_LENGTH                    0x00000001

#define _ADTBL23_ADCH4_POSITION                  0x00000004
#define _ADTBL23_ADCH4_MASK                      0x00000010
#define _ADTBL23_ADCH4_LENGTH                    0x00000001

#define _ADTBL23_ADCH5_POSITION                  0x00000005
#define _ADTBL23_ADCH5_MASK                      0x00000020
#define _ADTBL23_ADCH5_LENGTH                    0x00000001

#define _ADTBL23_ADCH6_POSITION                  0x00000006
#define _ADTBL23_ADCH6_MASK                      0x00000040
#define _ADTBL23_ADCH6_LENGTH                    0x00000001

#define _ADTBL24_ADCH_POSITION                   0x00000000
#define _ADTBL24_ADCH_MASK                       0x0000007F
#define _ADTBL24_ADCH_LENGTH                     0x00000007

#define _ADTBL24_DIFF_POSITION                   0x0000000E
#define _ADTBL24_DIFF_MASK                       0x00004000
#define _ADTBL24_DIFF_LENGTH                     0x00000001

#define _ADTBL24_UCTMU_POSITION                  0x0000000F
#define _ADTBL24_UCTMU_MASK                      0x00008000
#define _ADTBL24_UCTMU_LENGTH                    0x00000001

#define _ADTBL24_ADCH0_POSITION                  0x00000000
#define _ADTBL24_ADCH0_MASK                      0x00000001
#define _ADTBL24_ADCH0_LENGTH                    0x00000001

#define _ADTBL24_ADCH1_POSITION                  0x00000001
#define _ADTBL24_ADCH1_MASK                      0x00000002
#define _ADTBL24_ADCH1_LENGTH                    0x00000001

#define _ADTBL24_ADCH2_POSITION                  0x00000002
#define _ADTBL24_ADCH2_MASK                      0x00000004
#define _ADTBL24_ADCH2_LENGTH                    0x00000001

#define _ADTBL24_ADCH3_POSITION                  0x00000003
#define _ADTBL24_ADCH3_MASK                      0x00000008
#define _ADTBL24_ADCH3_LENGTH                    0x00000001

#define _ADTBL24_ADCH4_POSITION                  0x00000004
#define _ADTBL24_ADCH4_MASK                      0x00000010
#define _ADTBL24_ADCH4_LENGTH                    0x00000001

#define _ADTBL24_ADCH5_POSITION                  0x00000005
#define _ADTBL24_ADCH5_MASK                      0x00000020
#define _ADTBL24_ADCH5_LENGTH                    0x00000001

#define _ADTBL24_ADCH6_POSITION                  0x00000006
#define _ADTBL24_ADCH6_MASK                      0x00000040
#define _ADTBL24_ADCH6_LENGTH                    0x00000001

#define _ADTBL25_ADCH_POSITION                   0x00000000
#define _ADTBL25_ADCH_MASK                       0x0000007F
#define _ADTBL25_ADCH_LENGTH                     0x00000007

#define _ADTBL25_DIFF_POSITION                   0x0000000E
#define _ADTBL25_DIFF_MASK                       0x00004000
#define _ADTBL25_DIFF_LENGTH                     0x00000001

#define _ADTBL25_UCTMU_POSITION                  0x0000000F
#define _ADTBL25_UCTMU_MASK                      0x00008000
#define _ADTBL25_UCTMU_LENGTH                    0x00000001

#define _ADTBL25_ADCH0_POSITION                  0x00000000
#define _ADTBL25_ADCH0_MASK                      0x00000001
#define _ADTBL25_ADCH0_LENGTH                    0x00000001

#define _ADTBL25_ADCH1_POSITION                  0x00000001
#define _ADTBL25_ADCH1_MASK                      0x00000002
#define _ADTBL25_ADCH1_LENGTH                    0x00000001

#define _ADTBL25_ADCH2_POSITION                  0x00000002
#define _ADTBL25_ADCH2_MASK                      0x00000004
#define _ADTBL25_ADCH2_LENGTH                    0x00000001

#define _ADTBL25_ADCH3_POSITION                  0x00000003
#define _ADTBL25_ADCH3_MASK                      0x00000008
#define _ADTBL25_ADCH3_LENGTH                    0x00000001

#define _ADTBL25_ADCH4_POSITION                  0x00000004
#define _ADTBL25_ADCH4_MASK                      0x00000010
#define _ADTBL25_ADCH4_LENGTH                    0x00000001

#define _ADTBL25_ADCH5_POSITION                  0x00000005
#define _ADTBL25_ADCH5_MASK                      0x00000020
#define _ADTBL25_ADCH5_LENGTH                    0x00000001

#define _ADTBL25_ADCH6_POSITION                  0x00000006
#define _ADTBL25_ADCH6_MASK                      0x00000040
#define _ADTBL25_ADCH6_LENGTH                    0x00000001

#define _ADTBL26_ADCH_POSITION                   0x00000000
#define _ADTBL26_ADCH_MASK                       0x0000007F
#define _ADTBL26_ADCH_LENGTH                     0x00000007

#define _ADTBL26_DIFF_POSITION                   0x0000000E
#define _ADTBL26_DIFF_MASK                       0x00004000
#define _ADTBL26_DIFF_LENGTH                     0x00000001

#define _ADTBL26_UCTMU_POSITION                  0x0000000F
#define _ADTBL26_UCTMU_MASK                      0x00008000
#define _ADTBL26_UCTMU_LENGTH                    0x00000001

#define _ADTBL26_ADCH0_POSITION                  0x00000000
#define _ADTBL26_ADCH0_MASK                      0x00000001
#define _ADTBL26_ADCH0_LENGTH                    0x00000001

#define _ADTBL26_ADCH1_POSITION                  0x00000001
#define _ADTBL26_ADCH1_MASK                      0x00000002
#define _ADTBL26_ADCH1_LENGTH                    0x00000001

#define _ADTBL26_ADCH2_POSITION                  0x00000002
#define _ADTBL26_ADCH2_MASK                      0x00000004
#define _ADTBL26_ADCH2_LENGTH                    0x00000001

#define _ADTBL26_ADCH3_POSITION                  0x00000003
#define _ADTBL26_ADCH3_MASK                      0x00000008
#define _ADTBL26_ADCH3_LENGTH                    0x00000001

#define _ADTBL26_ADCH4_POSITION                  0x00000004
#define _ADTBL26_ADCH4_MASK                      0x00000010
#define _ADTBL26_ADCH4_LENGTH                    0x00000001

#define _ADTBL26_ADCH5_POSITION                  0x00000005
#define _ADTBL26_ADCH5_MASK                      0x00000020
#define _ADTBL26_ADCH5_LENGTH                    0x00000001

