draco-sam/WPT_drone/WPT/RX/RX_USB_I2C/01_lib_wpt_rx/PIC24FJ128GC006.h
#define _ANSELB_ANSB7_POSITION                   0x00000007
#define _ANSELB_ANSB7_MASK                       0x00000080
#define _ANSELB_ANSB7_LENGTH                     0x00000001

#define _ANSELB_ANSB12_POSITION                  0x0000000C
#define _ANSELB_ANSB12_MASK                      0x00001000
#define _ANSELB_ANSB12_LENGTH                    0x00000001

#define _ANSELB_ANSB13_POSITION                  0x0000000D
#define _ANSELB_ANSB13_MASK                      0x00002000
#define _ANSELB_ANSB13_LENGTH                    0x00000001

#define _ANSELB_ANSB14_POSITION                  0x0000000E
#define _ANSELB_ANSB14_MASK                      0x00004000
#define _ANSELB_ANSB14_LENGTH                    0x00000001

#define _ANSELB_ANSB15_POSITION                  0x0000000F
#define _ANSELB_ANSB15_MASK                      0x00008000
#define _ANSELB_ANSB15_LENGTH                    0x00000001

#define _ANSELB_ANSELB0_POSITION                 0x00000000
#define _ANSELB_ANSELB0_MASK                     0x00000001
#define _ANSELB_ANSELB0_LENGTH                   0x00000001

#define _ANSELB_ANSELB1_POSITION                 0x00000001
#define _ANSELB_ANSELB1_MASK                     0x00000002
#define _ANSELB_ANSELB1_LENGTH                   0x00000001

#define _ANSELB_ANSELB2_POSITION                 0x00000002
#define _ANSELB_ANSELB2_MASK                     0x00000004
#define _ANSELB_ANSELB2_LENGTH                   0x00000001

#define _ANSELB_ANSELB3_POSITION                 0x00000003
#define _ANSELB_ANSELB3_MASK                     0x00000008
#define _ANSELB_ANSELB3_LENGTH                   0x00000001

#define _ANSELB_ANSELB4_POSITION                 0x00000004
#define _ANSELB_ANSELB4_MASK                     0x00000010
#define _ANSELB_ANSELB4_LENGTH                   0x00000001

#define _ANSELB_ANSELB5_POSITION                 0x00000005
#define _ANSELB_ANSELB5_MASK                     0x00000020
#define _ANSELB_ANSELB5_LENGTH                   0x00000001

#define _ANSELB_ANSELB6_POSITION                 0x00000006
#define _ANSELB_ANSELB6_MASK                     0x00000040
#define _ANSELB_ANSELB6_LENGTH                   0x00000001

#define _ANSELB_ANSELB7_POSITION                 0x00000007
#define _ANSELB_ANSELB7_MASK                     0x00000080
#define _ANSELB_ANSELB7_LENGTH                   0x00000001

#define _ANSELB_ANSELB12_POSITION                0x0000000C
#define _ANSELB_ANSELB12_MASK                    0x00001000
#define _ANSELB_ANSELB12_LENGTH                  0x00000001

#define _ANSELB_ANSELB13_POSITION                0x0000000D
#define _ANSELB_ANSELB13_MASK                    0x00002000
#define _ANSELB_ANSELB13_LENGTH                  0x00000001

#define _ANSELB_ANSELB14_POSITION                0x0000000E
#define _ANSELB_ANSELB14_MASK                    0x00004000
#define _ANSELB_ANSELB14_LENGTH                  0x00000001

#define _ANSELB_ANSELB15_POSITION                0x0000000F
#define _ANSELB_ANSELB15_MASK                    0x00008000
#define _ANSELB_ANSELB15_LENGTH                  0x00000001

#define _ANSD_ANSD0_POSITION                     0x00000000
#define _ANSD_ANSD0_MASK                         0x00000001
#define _ANSD_ANSD0_LENGTH                       0x00000001

#define _ANSD_ANSD1_POSITION                     0x00000001
#define _ANSD_ANSD1_MASK                         0x00000002
#define _ANSD_ANSD1_LENGTH                       0x00000001

#define _ANSD_ANSD2_POSITION                     0x00000002
#define _ANSD_ANSD2_MASK                         0x00000004
#define _ANSD_ANSD2_LENGTH                       0x00000001

#define _ANSD_ANSD3_POSITION                     0x00000003
#define _ANSD_ANSD3_MASK                         0x00000008
#define _ANSD_ANSD3_LENGTH                       0x00000001

#define _ANSD_ANSD4_POSITION                     0x00000004
#define _ANSD_ANSD4_MASK                         0x00000010
#define _ANSD_ANSD4_LENGTH                       0x00000001

#define _ANSD_ANSD5_POSITION                     0x00000005
#define _ANSD_ANSD5_MASK                         0x00000020
#define _ANSD_ANSD5_LENGTH                       0x00000001

#define _ANSD_ANSD6_POSITION                     0x00000006
#define _ANSD_ANSD6_MASK                         0x00000040
#define _ANSD_ANSD6_LENGTH                       0x00000001

#define _ANSD_ANSD7_POSITION                     0x00000007
#define _ANSD_ANSD7_MASK                         0x00000080
#define _ANSD_ANSD7_LENGTH                       0x00000001

#define _ANSD_ANSD8_POSITION                     0x00000008
#define _ANSD_ANSD8_MASK                         0x00000100
#define _ANSD_ANSD8_LENGTH                       0x00000001

#define _ANSD_ANSD9_POSITION                     0x00000009
#define _ANSD_ANSD9_MASK                         0x00000200
#define _ANSD_ANSD9_LENGTH                       0x00000001

#define _ANSD_ANSD10_POSITION                    0x0000000A
#define _ANSD_ANSD10_MASK                        0x00000400
#define _ANSD_ANSD10_LENGTH                      0x00000001

#define _ANSD_ANSD11_POSITION                    0x0000000B
#define _ANSD_ANSD11_MASK                        0x00000800
#define _ANSD_ANSD11_LENGTH                      0x00000001

#define _ANSD_ANSD12_POSITION                    0x0000000C
#define _ANSD_ANSD12_MASK                        0x00001000
#define _ANSD_ANSD12_LENGTH                      0x00000001

#define _ANSD_ANSD13_POSITION                    0x0000000D
#define _ANSD_ANSD13_MASK                        0x00002000
#define _ANSD_ANSD13_LENGTH                      0x00000001

#define _ANSD_ANSD14_POSITION                    0x0000000E
#define _ANSD_ANSD14_MASK                        0x00004000
#define _ANSD_ANSD14_LENGTH                      0x00000001

#define _ANSD_ANSD15_POSITION                    0x0000000F
#define _ANSD_ANSD15_MASK                        0x00008000
#define _ANSD_ANSD15_LENGTH                      0x00000001

#define _ANSD_ANSELD0_POSITION                   0x00000000
#define _ANSD_ANSELD0_MASK                       0x00000001
#define _ANSD_ANSELD0_LENGTH                     0x00000001

#define _ANSD_ANSELD1_POSITION                   0x00000001
#define _ANSD_ANSELD1_MASK                       0x00000002
#define _ANSD_ANSELD1_LENGTH                     0x00000001

#define _ANSD_ANSELD2_POSITION                   0x00000002
#define _ANSD_ANSELD2_MASK                       0x00000004
#define _ANSD_ANSELD2_LENGTH                     0x00000001

