draco-sam/WPT_drone/WPT/RX/RX_USB_I2C/01_lib_wpt_rx/PIC24FJ128GC006.h
#define _ANSELD_ANSELD6_POSITION                 0x00000006
#define _ANSELD_ANSELD6_MASK                     0x00000040
#define _ANSELD_ANSELD6_LENGTH                   0x00000001

#define _ANSELD_ANSELD7_POSITION                 0x00000007
#define _ANSELD_ANSELD7_MASK                     0x00000080
#define _ANSELD_ANSELD7_LENGTH                   0x00000001

#define _ANSELD_ANSELD8_POSITION                 0x00000008
#define _ANSELD_ANSELD8_MASK                     0x00000100
#define _ANSELD_ANSELD8_LENGTH                   0x00000001

#define _ANSELD_ANSELD9_POSITION                 0x00000009
#define _ANSELD_ANSELD9_MASK                     0x00000200
#define _ANSELD_ANSELD9_LENGTH                   0x00000001

#define _ANSELD_ANSELD10_POSITION                0x0000000A
#define _ANSELD_ANSELD10_MASK                    0x00000400
#define _ANSELD_ANSELD10_LENGTH                  0x00000001

#define _ANSELD_ANSELD11_POSITION                0x0000000B
#define _ANSELD_ANSELD11_MASK                    0x00000800
#define _ANSELD_ANSELD11_LENGTH                  0x00000001

#define _ANSELD_ANSELD12_POSITION                0x0000000C
#define _ANSELD_ANSELD12_MASK                    0x00001000
#define _ANSELD_ANSELD12_LENGTH                  0x00000001

#define _ANSELD_ANSELD13_POSITION                0x0000000D
#define _ANSELD_ANSELD13_MASK                    0x00002000
#define _ANSELD_ANSELD13_LENGTH                  0x00000001

#define _ANSELD_ANSELD14_POSITION                0x0000000E
#define _ANSELD_ANSELD14_MASK                    0x00004000
#define _ANSELD_ANSELD14_LENGTH                  0x00000001

#define _ANSELD_ANSELD15_POSITION                0x0000000F
#define _ANSELD_ANSELD15_MASK                    0x00008000
#define _ANSELD_ANSELD15_LENGTH                  0x00000001

#define _ANSE_ANSE4_POSITION                     0x00000004
#define _ANSE_ANSE4_MASK                         0x00000010
#define _ANSE_ANSE4_LENGTH                       0x00000001

#define _ANSE_ANSE5_POSITION                     0x00000005
#define _ANSE_ANSE5_MASK                         0x00000020
#define _ANSE_ANSE5_LENGTH                       0x00000001

#define _ANSE_ANSE6_POSITION                     0x00000006
#define _ANSE_ANSE6_MASK                         0x00000040
#define _ANSE_ANSE6_LENGTH                       0x00000001

#define _ANSE_ANSE7_POSITION                     0x00000007
#define _ANSE_ANSE7_MASK                         0x00000080
#define _ANSE_ANSE7_LENGTH                       0x00000001

#define _ANSE_ANSELE4_POSITION                   0x00000004
#define _ANSE_ANSELE4_MASK                       0x00000010
#define _ANSE_ANSELE4_LENGTH                     0x00000001

#define _ANSE_ANSELE5_POSITION                   0x00000005
#define _ANSE_ANSELE5_MASK                       0x00000020
#define _ANSE_ANSELE5_LENGTH                     0x00000001

#define _ANSE_ANSELE6_POSITION                   0x00000006
#define _ANSE_ANSELE6_MASK                       0x00000040
#define _ANSE_ANSELE6_LENGTH                     0x00000001

#define _ANSE_ANSELE7_POSITION                   0x00000007
#define _ANSE_ANSELE7_MASK                       0x00000080
#define _ANSE_ANSELE7_LENGTH                     0x00000001

#define _ANSELE_ANSE4_POSITION                   0x00000004
#define _ANSELE_ANSE4_MASK                       0x00000010
#define _ANSELE_ANSE4_LENGTH                     0x00000001

#define _ANSELE_ANSE5_POSITION                   0x00000005
#define _ANSELE_ANSE5_MASK                       0x00000020
#define _ANSELE_ANSE5_LENGTH                     0x00000001

#define _ANSELE_ANSE6_POSITION                   0x00000006
#define _ANSELE_ANSE6_MASK                       0x00000040
#define _ANSELE_ANSE6_LENGTH                     0x00000001

#define _ANSELE_ANSE7_POSITION                   0x00000007
#define _ANSELE_ANSE7_MASK                       0x00000080
#define _ANSELE_ANSE7_LENGTH                     0x00000001

#define _ANSELE_ANSELE4_POSITION                 0x00000004
#define _ANSELE_ANSELE4_MASK                     0x00000010
#define _ANSELE_ANSELE4_LENGTH                   0x00000001

#define _ANSELE_ANSELE5_POSITION                 0x00000005
#define _ANSELE_ANSELE5_MASK                     0x00000020
#define _ANSELE_ANSELE5_LENGTH                   0x00000001

#define _ANSELE_ANSELE6_POSITION                 0x00000006
#define _ANSELE_ANSELE6_MASK                     0x00000040
#define _ANSELE_ANSELE6_LENGTH                   0x00000001

#define _ANSELE_ANSELE7_POSITION                 0x00000007
#define _ANSELE_ANSELE7_MASK                     0x00000080
#define _ANSELE_ANSELE7_LENGTH                   0x00000001

#define _ANSELF_ANSF0_POSITION                   0x00000000
#define _ANSELF_ANSF0_MASK                       0x00000001
#define _ANSELF_ANSF0_LENGTH                     0x00000001

#define _ANSELF_ANSF3_POSITION                   0x00000003
#define _ANSELF_ANSF3_MASK                       0x00000008
#define _ANSELF_ANSF3_LENGTH                     0x00000001

#define _ANSELF_ANSF4_POSITION                   0x00000004
#define _ANSELF_ANSF4_MASK                       0x00000010
#define _ANSELF_ANSF4_LENGTH                     0x00000001

#define _ANSELF_ANSF5_POSITION                   0x00000005
#define _ANSELF_ANSF5_MASK                       0x00000020
#define _ANSELF_ANSF5_LENGTH                     0x00000001

#define _ANSELF_ANSF7_POSITION                   0x00000007
#define _ANSELF_ANSF7_MASK                       0x00000080
#define _ANSELF_ANSF7_LENGTH                     0x00000001

#define _ANSELF_ANSELF0_POSITION                 0x00000000
#define _ANSELF_ANSELF0_MASK                     0x00000001
#define _ANSELF_ANSELF0_LENGTH                   0x00000001

#define _ANSELF_ANSELF3_POSITION                 0x00000003
#define _ANSELF_ANSELF3_MASK                     0x00000008
#define _ANSELF_ANSELF3_LENGTH                   0x00000001

#define _ANSELF_ANSELF4_POSITION                 0x00000004
#define _ANSELF_ANSELF4_MASK                     0x00000010
#define _ANSELF_ANSELF4_LENGTH                   0x00000001

#define _ANSELF_ANSELF5_POSITION                 0x00000005
#define _ANSELF_ANSELF5_MASK                     0x00000020
#define _ANSELF_ANSELF5_LENGTH                   0x00000001

#define _ANSELF_ANSELF7_POSITION                 0x00000007
#define _ANSELF_ANSELF7_MASK                     0x00000080
#define _ANSELF_ANSELF7_LENGTH                   0x00000001

#define _ANSF_ANSF0_POSITION                     0x00000000
#define _ANSF_ANSF0_MASK                         0x00000001
#define _ANSF_ANSF0_LENGTH                       0x00000001

#define _ANSF_ANSF3_POSITION                     0x00000003
#define _ANSF_ANSF3_MASK                         0x00000008
#define _ANSF_ANSF3_LENGTH                       0x00000001

