draco-sam/WPT_drone/WPT/RX/RX_USB_I2C/01_lib_wpt_rx/PIC24FJ128GC006.h
#define _LCDDATA20_S2C5_POSITION                 0x00000002
#define _LCDDATA20_S2C5_MASK                     0x00000004
#define _LCDDATA20_S2C5_LENGTH                   0x00000001

#define _LCDDATA20_S3C5_POSITION                 0x00000003
#define _LCDDATA20_S3C5_MASK                     0x00000008
#define _LCDDATA20_S3C5_LENGTH                   0x00000001

#define _LCDDATA20_S4C5_POSITION                 0x00000004
#define _LCDDATA20_S4C5_MASK                     0x00000010
#define _LCDDATA20_S4C5_LENGTH                   0x00000001

#define _LCDDATA20_S5C5_POSITION                 0x00000005
#define _LCDDATA20_S5C5_MASK                     0x00000020
#define _LCDDATA20_S5C5_LENGTH                   0x00000001

#define _LCDDATA20_S6C5_POSITION                 0x00000006
#define _LCDDATA20_S6C5_MASK                     0x00000040
#define _LCDDATA20_S6C5_LENGTH                   0x00000001

#define _LCDDATA20_S7C5_POSITION                 0x00000007
#define _LCDDATA20_S7C5_MASK                     0x00000080
#define _LCDDATA20_S7C5_LENGTH                   0x00000001

#define _LCDDATA20_S8C5_POSITION                 0x00000008
#define _LCDDATA20_S8C5_MASK                     0x00000100
#define _LCDDATA20_S8C5_LENGTH                   0x00000001

#define _LCDDATA20_S9C5_POSITION                 0x00000009
#define _LCDDATA20_S9C5_MASK                     0x00000200
#define _LCDDATA20_S9C5_LENGTH                   0x00000001

#define _LCDDATA20_S10C5_POSITION                0x0000000A
#define _LCDDATA20_S10C5_MASK                    0x00000400
#define _LCDDATA20_S10C5_LENGTH                  0x00000001

#define _LCDDATA20_S11C5_POSITION                0x0000000B
#define _LCDDATA20_S11C5_MASK                    0x00000800
#define _LCDDATA20_S11C5_LENGTH                  0x00000001

#define _LCDDATA20_S12C5_POSITION                0x0000000C
#define _LCDDATA20_S12C5_MASK                    0x00001000
#define _LCDDATA20_S12C5_LENGTH                  0x00000001

#define _LCDDATA20_S13C5_POSITION                0x0000000D
#define _LCDDATA20_S13C5_MASK                    0x00002000
#define _LCDDATA20_S13C5_LENGTH                  0x00000001

#define _LCDDATA20_S14C5_POSITION                0x0000000E
#define _LCDDATA20_S14C5_MASK                    0x00004000
#define _LCDDATA20_S14C5_LENGTH                  0x00000001

#define _LCDDATA20_S15C5_POSITION                0x0000000F
#define _LCDDATA20_S15C5_MASK                    0x00008000
#define _LCDDATA20_S15C5_LENGTH                  0x00000001

#define _LCDDATA21_S16C5_POSITION                0x00000000
#define _LCDDATA21_S16C5_MASK                    0x00000001
#define _LCDDATA21_S16C5_LENGTH                  0x00000001

#define _LCDDATA21_S17C5_POSITION                0x00000001
#define _LCDDATA21_S17C5_MASK                    0x00000002
#define _LCDDATA21_S17C5_LENGTH                  0x00000001

#define _LCDDATA21_S18C5_POSITION                0x00000002
#define _LCDDATA21_S18C5_MASK                    0x00000004
#define _LCDDATA21_S18C5_LENGTH                  0x00000001

#define _LCDDATA21_S19C5_POSITION                0x00000003
#define _LCDDATA21_S19C5_MASK                    0x00000008
#define _LCDDATA21_S19C5_LENGTH                  0x00000001

#define _LCDDATA21_S20C5_POSITION                0x00000004
#define _LCDDATA21_S20C5_MASK                    0x00000010
#define _LCDDATA21_S20C5_LENGTH                  0x00000001

#define _LCDDATA21_S21C5_POSITION                0x00000005
#define _LCDDATA21_S21C5_MASK                    0x00000020
#define _LCDDATA21_S21C5_LENGTH                  0x00000001

#define _LCDDATA21_S22C5_POSITION                0x00000006
#define _LCDDATA21_S22C5_MASK                    0x00000040
#define _LCDDATA21_S22C5_LENGTH                  0x00000001

#define _LCDDATA21_S23C5_POSITION                0x00000007
#define _LCDDATA21_S23C5_MASK                    0x00000080
#define _LCDDATA21_S23C5_LENGTH                  0x00000001

#define _LCDDATA21_S24C5_POSITION                0x00000008
#define _LCDDATA21_S24C5_MASK                    0x00000100
#define _LCDDATA21_S24C5_LENGTH                  0x00000001

#define _LCDDATA21_S25C5_POSITION                0x00000009
#define _LCDDATA21_S25C5_MASK                    0x00000200
#define _LCDDATA21_S25C5_LENGTH                  0x00000001

#define _LCDDATA21_S26C5_POSITION                0x0000000A
#define _LCDDATA21_S26C5_MASK                    0x00000400
#define _LCDDATA21_S26C5_LENGTH                  0x00000001

#define _LCDDATA21_S27C5_POSITION                0x0000000B
#define _LCDDATA21_S27C5_MASK                    0x00000800
#define _LCDDATA21_S27C5_LENGTH                  0x00000001

#define _LCDDATA21_S30C5_POSITION                0x0000000E
#define _LCDDATA21_S30C5_MASK                    0x00004000
#define _LCDDATA21_S30C5_LENGTH                  0x00000001

#define _LCDDATA22_S47C5_POSITION                0x0000000F
#define _LCDDATA22_S47C5_MASK                    0x00008000
#define _LCDDATA22_S47C5_LENGTH                  0x00000001

#define _LCDDATA23_S48C5_POSITION                0x00000000
#define _LCDDATA23_S48C5_MASK                    0x00000001
#define _LCDDATA23_S48C5_LENGTH                  0x00000001

#define _LCDDATA23_S62C5_POSITION                0x0000000E
#define _LCDDATA23_S62C5_MASK                    0x00004000
#define _LCDDATA23_S62C5_LENGTH                  0x00000001

#define _LCDDATA24_S0C6_POSITION                 0x00000000
#define _LCDDATA24_S0C6_MASK                     0x00000001
#define _LCDDATA24_S0C6_LENGTH                   0x00000001

#define _LCDDATA24_S1C6_POSITION                 0x00000001
#define _LCDDATA24_S1C6_MASK                     0x00000002
#define _LCDDATA24_S1C6_LENGTH                   0x00000001

#define _LCDDATA24_S2C6_POSITION                 0x00000002
#define _LCDDATA24_S2C6_MASK                     0x00000004
#define _LCDDATA24_S2C6_LENGTH                   0x00000001

#define _LCDDATA24_S3C6_POSITION                 0x00000003
#define _LCDDATA24_S3C6_MASK                     0x00000008
#define _LCDDATA24_S3C6_LENGTH                   0x00000001

#define _LCDDATA24_S4C6_POSITION                 0x00000004
#define _LCDDATA24_S4C6_MASK                     0x00000010
#define _LCDDATA24_S4C6_LENGTH                   0x00000001

#define _LCDDATA24_S5C6_POSITION                 0x00000005
#define _LCDDATA24_S5C6_MASK                     0x00000020
#define _LCDDATA24_S5C6_LENGTH                   0x00000001

#define _LCDDATA24_S6C6_POSITION                 0x00000006
#define _LCDDATA24_S6C6_MASK                     0x00000040
#define _LCDDATA24_S6C6_LENGTH                   0x00000001

