draco-sam/WPT_drone/WPT/RX/RX_USB_I2C/01_lib_wpt_rx/PIC24FJ128GC006.h
#define _BUFCON2_BUFSTBY_POSITION                0x00000006
#define _BUFCON2_BUFSTBY_MASK                    0x00000040
#define _BUFCON2_BUFSTBY_LENGTH                  0x00000001

#define _BUFCON2_BUFOE_POSITION                  0x00000007
#define _BUFCON2_BUFOE_MASK                      0x00000080
#define _BUFCON2_BUFOE_LENGTH                    0x00000001

#define _BUFCON2_BUFSLP_POSITION                 0x0000000C
#define _BUFCON2_BUFSLP_MASK                     0x00001000
#define _BUFCON2_BUFSLP_LENGTH                   0x00000001

#define _BUFCON2_BUFSIDL_POSITION                0x0000000D
#define _BUFCON2_BUFSIDL_MASK                    0x00002000
#define _BUFCON2_BUFSIDL_LENGTH                  0x00000001

#define _BUFCON2_BUFEN_POSITION                  0x0000000F
#define _BUFCON2_BUFEN_MASK                      0x00008000
#define _BUFCON2_BUFEN_LENGTH                    0x00000001

#define _BUFCON2_BUFREF0_POSITION                0x00000000
#define _BUFCON2_BUFREF0_MASK                    0x00000001
#define _BUFCON2_BUFREF0_LENGTH                  0x00000001

#define _BUFCON2_BUFREF1_POSITION                0x00000001
#define _BUFCON2_BUFREF1_MASK                    0x00000002
#define _BUFCON2_BUFREF1_LENGTH                  0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x00003F00
#define _RPINR0_INT1R_LENGTH                     0x00000006

#define _RPINR0_INT1R0_POSITION                  0x00000008
#define _RPINR0_INT1R0_MASK                      0x00000100
#define _RPINR0_INT1R0_LENGTH                    0x00000001

#define _RPINR0_INT1R1_POSITION                  0x00000009
#define _RPINR0_INT1R1_MASK                      0x00000200
#define _RPINR0_INT1R1_LENGTH                    0x00000001

#define _RPINR0_INT1R2_POSITION                  0x0000000A
#define _RPINR0_INT1R2_MASK                      0x00000400
#define _RPINR0_INT1R2_LENGTH                    0x00000001

#define _RPINR0_INT1R3_POSITION                  0x0000000B
#define _RPINR0_INT1R3_MASK                      0x00000800
#define _RPINR0_INT1R3_LENGTH                    0x00000001

#define _RPINR0_INT1R4_POSITION                  0x0000000C
#define _RPINR0_INT1R4_MASK                      0x00001000
#define _RPINR0_INT1R4_LENGTH                    0x00000001

#define _RPINR0_INT1R5_POSITION                  0x0000000D
#define _RPINR0_INT1R5_MASK                      0x00002000
#define _RPINR0_INT1R5_LENGTH                    0x00000001

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x0000003F
#define _RPINR1_INT2R_LENGTH                     0x00000006

#define _RPINR1_INT3R_POSITION                   0x00000008
#define _RPINR1_INT3R_MASK                       0x00003F00
#define _RPINR1_INT3R_LENGTH                     0x00000006

#define _RPINR1_INT2R0_POSITION                  0x00000000
#define _RPINR1_INT2R0_MASK                      0x00000001
#define _RPINR1_INT2R0_LENGTH                    0x00000001

#define _RPINR1_INT2R1_POSITION                  0x00000001
#define _RPINR1_INT2R1_MASK                      0x00000002
#define _RPINR1_INT2R1_LENGTH                    0x00000001

#define _RPINR1_INT2R2_POSITION                  0x00000002
#define _RPINR1_INT2R2_MASK                      0x00000004
#define _RPINR1_INT2R2_LENGTH                    0x00000001

#define _RPINR1_INT2R3_POSITION                  0x00000003
#define _RPINR1_INT2R3_MASK                      0x00000008
#define _RPINR1_INT2R3_LENGTH                    0x00000001

#define _RPINR1_INT2R4_POSITION                  0x00000004
#define _RPINR1_INT2R4_MASK                      0x00000010
#define _RPINR1_INT2R4_LENGTH                    0x00000001

#define _RPINR1_INT2R5_POSITION                  0x00000005
#define _RPINR1_INT2R5_MASK                      0x00000020
#define _RPINR1_INT2R5_LENGTH                    0x00000001

#define _RPINR1_INT3R0_POSITION                  0x00000008
#define _RPINR1_INT3R0_MASK                      0x00000100
#define _RPINR1_INT3R0_LENGTH                    0x00000001

#define _RPINR1_INT3R1_POSITION                  0x00000009
#define _RPINR1_INT3R1_MASK                      0x00000200
#define _RPINR1_INT3R1_LENGTH                    0x00000001

#define _RPINR1_INT3R2_POSITION                  0x0000000A
#define _RPINR1_INT3R2_MASK                      0x00000400
#define _RPINR1_INT3R2_LENGTH                    0x00000001

#define _RPINR1_INT3R3_POSITION                  0x0000000B
#define _RPINR1_INT3R3_MASK                      0x00000800
#define _RPINR1_INT3R3_LENGTH                    0x00000001

#define _RPINR1_INT3R4_POSITION                  0x0000000C
#define _RPINR1_INT3R4_MASK                      0x00001000
#define _RPINR1_INT3R4_LENGTH                    0x00000001

#define _RPINR1_INT3R5_POSITION                  0x0000000D
#define _RPINR1_INT3R5_MASK                      0x00002000
#define _RPINR1_INT3R5_LENGTH                    0x00000001

#define _RPINR2_INT4R_POSITION                   0x00000000
#define _RPINR2_INT4R_MASK                       0x0000003F
#define _RPINR2_INT4R_LENGTH                     0x00000006

#define _RPINR2_INT4R0_POSITION                  0x00000000
#define _RPINR2_INT4R0_MASK                      0x00000001
#define _RPINR2_INT4R0_LENGTH                    0x00000001

#define _RPINR2_INT4R1_POSITION                  0x00000001
#define _RPINR2_INT4R1_MASK                      0x00000002
#define _RPINR2_INT4R1_LENGTH                    0x00000001

#define _RPINR2_INT4R2_POSITION                  0x00000002
#define _RPINR2_INT4R2_MASK                      0x00000004
#define _RPINR2_INT4R2_LENGTH                    0x00000001

#define _RPINR2_INT4R3_POSITION                  0x00000003
#define _RPINR2_INT4R3_MASK                      0x00000008
#define _RPINR2_INT4R3_LENGTH                    0x00000001

#define _RPINR2_INT4R4_POSITION                  0x00000004
#define _RPINR2_INT4R4_MASK                      0x00000010
#define _RPINR2_INT4R4_LENGTH                    0x00000001

