draco-sam/WPT_drone/WPT/RX/RX_USB_I2C/01_lib_wpt_rx/PIC24FJ128GC006.h
#define WINDIS_ON            0xFFDF
#define WINDIS_OFF           0xFFFF

#define FWDTEN_WDT_DIS       0xFF3F
#define FWDTEN_WDT_ACT       0xFF7F
#define FWDTEN_WDT_SW        0xFFBF
#define FWDTEN_WDT_HW        0xFFFF

#define ICS_PGx3             0xFDFF
#define ICS_PGx2             0xFEFF
#define ICS_PGx1             0xFFFF

#define LPCFG_ON             0xFBFF
#define LPCFG_OFF            0xFFFF

#define GWRP_ON              0xEFFF
#define GWRP_OFF             0xFFFF

#define GCP_ON               0xDFFF
#define GCP_OFF              0xFFFF

#define JTAGEN_OFF           0xBFFF
#define JTAGEN_ON            0xFFFF



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x155f8

#define __CONFIG4_BASE 0x157f8
#define __CONFIG4_LENGTH 0x2

#define __CONFIG3_BASE 0x157fa
#define __CONFIG3_LENGTH 0x2

#define __CONFIG2_BASE 0x157fc
#define __CONFIG2_LENGTH 0x2

#define __CONFIG1_BASE 0x157fe
#define __CONFIG1_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x2000


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_C1OUT 1
#define _RPOUT_C2OUT 2
#define _RPOUT_U1TX 3
#define _RPOUT_U1RTS 4
#define _RPOUT_U2TX 5
#define _RPOUT_U2RTS 6
#define _RPOUT_SDO1 7
#define _RPOUT_SCK1OUT 8
#define _RPOUT_SS1OUT 9
#define _RPOUT_SDO2 10
#define _RPOUT_SCK2OUT 11
#define _RPOUT_SS2OUT 12
#define _RPOUT_OC1 18
#define _RPOUT_OC2 19
#define _RPOUT_OC3 20
#define _RPOUT_OC4 21
#define _RPOUT_OC5 22
#define _RPOUT_OC6 23
#define _RPOUT_OC7 24
#define _RPOUT_OC8 25
#define _RPOUT_U3TX 28
#define _RPOUT_U3RTS 29
#define _RPOUT_U4TX 30
#define _RPOUT_U4RTS 31
#define _RPOUT_OC9 35
#define _RPOUT_C3OUT 36
#define _RPOUT_MDOUT 37

#endif
